#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_key_pair.my_key: Refreshing state... [id=my_key]
data.aws_ami.rhel: Reading...
aws_vpc.aap_vpc: Refreshing state... [id=vpc-05494b9e91ff62ee7]
data.aws_ami.rhel: Read complete after 0s [id=ami-09d5ee2fe22f85a55]
aws_internet_gateway.aap_igw: Refreshing state... [id=igw-07fb08b01ebc665ae]
aws_security_group.aap_security_group: Refreshing state... [id=sg-0e823437584865b3a]
aws_subnet.aap_subnet: Refreshing state... [id=subnet-07ca85a3793ac70cb]
aws_route_table.aap_pub_igw: Refreshing state... [id=rtb-0b46f38d64da10261]
aws_security_group_rule.grpc_ingress_access: Refreshing state... [id=sgrule-871749468]
aws_security_group_rule.http_ingress_access: Refreshing state... [id=sgrule-138791737]
aws_security_group_rule.secure_ingress_access: Refreshing state... [id=sgrule-3474815055]
aws_security_group_rule.postgresql_ingress_access: Refreshing state... [id=sgrule-2201241878]
aws_security_group_rule.ssh_ingress_access: Refreshing state... [id=sgrule-3201275532]
aws_security_group_rule.https_ingress_access: Refreshing state... [id=sgrule-2752642101]
aws_security_group_rule.egress_access: Refreshing state... [id=sgrule-2497426819]
aws_security_group_rule.redis_ingress_access: Refreshing state... [id=sgrule-2184343800]
aws_route_table_association.aap_rt_subnet_public: Refreshing state... [id=rtbassoc-06e9c5881f7a75fca]
aws_instance.aap_instance: Refreshing state... [id=i-08f5907ac2fd51607]
ansible_host.aap_instance: Refreshing state... [id=ec2-3-147-53-32.us-east-2.compute.amazonaws.com]
null_resource.hostname_update: Refreshing state... [id=8535962653223946660]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_key_pair.my_key must be replaced
-/+ resource "aws_key_pair" "my_key" {
      ~ arn             = "arn:aws:ec2:us-east-2:520320057172:key-pair/my_key" -> (known after apply)
      ~ fingerprint     = "bd:74:90:74:3e:a0:5f:48:ff:99:36:6c:1e:f6:a9:43" -> (known after apply)
      ~ id              = "my_key" -> (known after apply)
      + key_name_prefix = (known after apply)
      ~ key_pair_id     = "key-0128a38b497ca2be7" -> (known after apply)
      ~ key_type        = "rsa" -> (known after apply)
      ~ public_key      = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQC0YP818L8HTt+pKUU+XPD8dJ9kYDhtplUKaodICGcS63A6EgdGGaxh45DVz8JmTNbP3RHQw6XbfTjNGmOO56UaGxQOsc+ONZ8fFjd+qa+7hBo6tIlrdRkrgZgKNDhTh4HijDgaqpPLhXroUK2TE61CSCiJezVbwwXtXU43wQYoeR06E+Ji1lfLLb5b5pIuUKwTRwa+6u9zL7JrDznKq5YZxsmkX3PNI9gHQT+SnSqPOGctXhbMQX7JWZA60EFx8MZXe8O9QC3LMrgNv90CCR9qnyd7/WTtb+lk/7lTYbFfj2W0WsQZMc2tnvoNv8azeCQcSHs6U2nsKd7lxXmmD0OFtXxSqI/O1628Q71sFjPIvET04I9ENHaAWwaI3s98I3Lt8Z5NLNqHrxwhmrFT5mTdn91Fzq4Ax7UKqcVG8Rtkzg7HnXL6nLIQs/cdRprysJIGC0aEpoHSN1OTqMcJkP4ySv5aYgT/G68Uau5JkBS8tKbeKNw+KE4Aq6tUJ+3etYc= brthomps@brthomps-thinkpadx1carbongen9.remote.csb" -> (known after apply) # forces replacement
      - tags            = {} -> null
      ~ tags_all        = {} -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # null_resource.hostname_update is tainted, so must be replaced
-/+ resource "null_resource" "hostname_update" {
      ~ id = "8535962653223946660" -> (known after apply)
    }

  # tls_private_key.my_key will be created
  + resource "tls_private_key" "my_key" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 2048
    }

Plan: 3 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  + private_key = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @r3dact3d, Action: `pull_request`*